#!/usr/bin/env bash
set -euo pipefail

ansi_art='                           ▄▄▄
 ▄███████  ███   ███   ▄███████  ▄███████████▄   ▄███████    ▄███████   ▄███████    ▄█   █▄
███   ███  ███   ███  ███             ███       ███   ███   ███   ███  ███   ███   ███   ███
███   █▀   ███   ███  ███             ███       ███   ███   ███   ███  ███   █▀    ███   ███
███        ███   ███  ▀███████▄       ███      ▄███▄▄▄███  ▄███▄▄▄██▀  ███        ▄███▄▄▄███▄
███        ███   ███        ███       ███      ▀███▀▀▀███  ▀███▀▀▀▀    ███       ▀▀███▀▀▀███
███   █▄   ███   ███        ███       ███       ███   ███  ██████████  ███   █▄    ███   ███
███   ███  ███   ███        ███       ███       ███   ███   ███   ███  ███   ███   ███   ███
███████▀    ▀█████▀    ▀█████▀        ███       ███   █▀    ███   ███  ███████▀    ███   █▀
                                                            ███   █▀                         '

clear
echo -e "\n$ansi_art\n"

if ! command -v git >/dev/null 2>&1; then
    echo "[*] Installing git..."
    pacman -Sy --noconfirm git
fi

WORKDIR="/tmp/custarch"

rm -rf "$WORKDIR"

echo "[*] Cloning repo..."
git clone https://github.com/sdrtba/CustArch.git $WORKDIR
cd $WORKDIR

source "install.conf"
echo $TIMEZONE

chmod +x $WORKDIR/stages/*.sh
chmod +x $WORKDIR/chroot/*.sh
chmod +x $WORKDIR/lib/*.sh

echo "[*] Running stage 01..."
bash "$WORKDIR/stages/01-partition.sh"

echo "[*] Running stage 02..."
bash "$WORKDIR/stages/02-format-mount.sh"

echo "[*] Running stage 03..."
bash "$WORKDIR/stages/03-pacstrap.sh"

echo "[*] Running stage 04..."
bash "$WORKDIR/stages/04-run-chroot.sh"

echo "[*] Installation steps finished."
