#!/bin/bash
ansi_art='                           ▄▄▄
 ▄███████  ███   ███   ▄███████  ▄███████████▄   ▄███████    ▄███████   ▄███████    ▄█   █▄
███   ███  ███   ███  ███             ███       ███   ███   ███   ███  ███   ███   ███   ███
███   █▀   ███   ███  ███             ███       ███   ███   ███   ███  ███   █▀    ███   ███
███        ███   ███  ▀███████▄       ███      ▄███▄▄▄███  ▄███▄▄▄██▀  ███        ▄███▄▄▄███▄
███        ███   ███        ███       ███      ▀███▀▀▀███  ▀███▀▀▀▀    ███       ▀▀███▀▀▀███
███   █▄   ███   ███        ███       ███       ███   ███  ██████████  ███   █▄    ███   ███
███   ███  ███   ███        ███       ███       ███   ███   ███   ███  ███   ███   ███   ███
███████▀    ▀█████▀    ▀█████▀        ███       ███   █▀    ███   ███  ███████▀    ███   █▀
                                                            ███   █▀                         '

clear
echo -e "\n$ansi_art\n"

OMARCHY_REPO="sdrtba/CustArch"
REPO_DIR="~/custarch"
echo -e "\nCloning repo from: https://github.com/${OMARCHY_REPO}.git"
rm -rf $REPO_DIR
git clone "https://github.com/${OMARCHY_REPO}.git" $REPO_DIR >/dev/null

echo -e "\nInstallation starting..."
source "${REPO_DIR}/install.sh"
